// 商品マスターデータ
const itemMasterData = [
    { "品番": "00083-BBT", "商品名": "トムスTシャツ 4.0オンス", "サイズ(カンマ区切り)": "150,160,S,M,L,XL,XXL", "カラー(カンマ区切り)": "ホワイト,ブラック,レッド,ブルー,ネイビー", "カテゴリ": "Tシャツ" },
    { "品番": "00085-CVT", "商品名": "トムスTシャツ 5.6オンス", "サイズ(カンマ区切り)": "100,110,120,S,M,L,XL,XXL,XXXL", "カラー(カンマ区切り)": "ホワイト,ブラック,レッド,ネイビー,ロイヤルブルー", "カテゴリ": "Tシャツ" },
    { "品番": "00300-ACT", "商品名": "ドライTシャツ 4.4オンス", "サイズ(カンマ区切り)": "SS,S,M,L,LL,3L,4L,5L", "カラー(カンマ区切り)": "ホワイト,ブラック,レッド,ネイビー,ロイヤルブルー,グリーン,オレンジ,ピンク", "カテゴリ": "Tシャツ" },
    { "品番": "P-100", "商品名": "タフドライTシャツ", "サイズ(カンマ区切り)": "110,120,130,140,150,S,M,L,XL,XXL", "カラー(カンマ区切り)": "ホワイト,ブラック,ネイビー,ロイヤルブルー,レッド", "カテゴリ": "Tシャツ" },
    { "品番": "P-200", "商品名": "スウェットパンツ", "サイズ(カンマ区切り)": "S,M,L,XL,XXL", "カラー(カンマ区切り)": "グレー,ブラック,ネイビー", "カテゴリ": "パンツ" },
    { "品番": "00321-ACR", "商品名": "ドライハーフパンツ", "サイズ(カンマ区切り)": "SS,S,M,L,LL,3L", "カラー(カンマ区切り)": "ブラック,ネイビー,レッド,ロイヤルブルー,ダークグレー", "カテゴリ": "パンツ" }
];